"%@ - Offline" = "%@ - Offline";

"3D Secure" = "3D Secure";

"Add New Card…" = "Adăugare card nou...";

"Add a Card" = "Adăugare card";

"Apt." = "Apartament";

"Contact" = "Detalii de contact";

"Delivery" = "Informații privind livrarea";

"Delivery Address" = "Adresa de livrare";

"Free" = "Expediere gratuită";

"Invalid Shipping Address" = "Adresa de expediere nu este validă";

"Loading…" = "Se încarcă...";

"Multibanco" = "Multibanco";

"Next" = "Următorul";

"Online Banking (FPX)" = "Servicii bancare electronice (FPX)";

"Payment Method" = "Metoda de plată";

"Shipping" = "Expediere";

"Shipping Method" = "Metoda de expediere";

"Use Billing" = "Utilizare adresă de facturare";

"Use Delivery" = "Utilizare adresă de livrare";

"Use Shipping" = "Utilizare adresă de expediere";
